{
  "en": {
    "plugin.name": "toggl Data Export",
    "plugin.summary": "As a freelancer, you often can't choose the rules of your clients. Some require time recording and they usually use different systems than you do. This plugin is intended for this purpose. If you record your own times with Tyme, but one of your clients uses toggl Track, you either have to record your times twice or export them to Toggl.\n\nTo use this plugin, the project names and task names of Tyme and Toggl must match exactly.\nWhen generating the preview, the plugin checks whether all selected projects and tasks are also available in toggl. If there are differences or the projects and tasks cannot be found in toggl, the plugin generates an error report in the preview window and marks all incorrect data records in red.\n\nNote: The Tyme category is used as a client in toggl.\n\nThe export button remains clickable in this case, but does not start the export until the errors are corrected.",
    "locale.identifier": "en-US",
    "input.key": "toggl API Key",
    "input.key.placeholder": "Please enter your API key",
    "input.key.hint": "You can find the token in your [toggl profile](https://track.toggl.com/profile).",
    "input.startdate": "From",
    "input.enddate": "To",
    "input.billed": "Mark exported time entries as billed",
    "input.unbilled": "Export only unbilled time entries",
    "input.nonbillable": "Include non-billable tasks",
    "table.start": "Start Time",
    "table.duration": "Duration (minutes)",
    "table.client": "Client",
    "table.project": "Project",
    "table.task": "Task",
    "table.description": "Description",
    "error.header": "The following data could not be found in toggl",
    "error.missedProjects": "Missing Projects:",
    "error.missedTasks": "Missing Tasks:",
    "error.explain": "Change your selection or rename projects and tasks so that they correspond to those in toggl or create them in toggl. The Export button will not trigger anything until the problem is solved.",
    "error.noError": "Everything is fine, press Export below, to push the records to toggl.",
    "error.api": "No access to your toggl account. Please check your API key."
  },
  "de": {
    "plugin.name": "toggl Daten Export",
    "plugin.summary": "Als Freiberufler kannst du dir die Regeln deiner Kunden oft nicht aussuchen. Einige verlangen eine Zeiterfassung, und sie verwenden meist andere Systeme als Sie. Dieses Plugin ist für diesen Zweck gedacht. Wenn du deine eigenen Zeiten mit Tyme erfasst, aber einer deiner Kunden Toggl Track verwendet, musst du entweder deine Zeiten doppelt erfassen oder sie nach Toggl exportieren.\n\nUm dieses Plugin zu nutzen, müssen die Projekt- und Aufgabennamen von Tyme und Toggl exakt übereinstimmen.\nBeim Erzeugen der Vorschau prüft das Plugin, ob alle ausgewählten Projekte und Aufgaben auch in Toggl vorhanden sind. Bei Unterschieden oder wenn die Projekte und Aufgaben in Toggl nicht gefunden werden, generiert das Plugin eine Fehlermeldung im Vorschaufenster und markiert alle fehlerhaften Datensätze in rot.\n\nHinweis: Die Kategorie Tyme wird in toggl als Mandant verwendet.\n\nDer Export-Button bleibt in diesem Fall klickbar, startet den Export aber erst, wenn die Fehler behoben sind.",
    "locale.identifier": "de-DE",
    "input.key": "toggl API Key",
    "input.key.placeholder": "Bitte gib deinen API Schlüssel ein",
    "input.key.hint": "Du findest den API Token in deinem [toggl Profil](https://track.toggl.com/profile).",
    "input.startdate": "Von",
    "input.enddate": "Bis",
    "input.billed": "Exportierte Zeiten als berechnet markieren",
    "input.unbilled": "Nur nicht berechnete Zeiteinträge exportieren",
    "input.nonbillable": "Nicht berechenbare Aufgaben inkludieren",
    "table.start": "Start Zeit",
    "table.duration": "Dauer (Minuten)",
    "table.client": "Kunde",
    "table.project": "Projekt",
    "table.task": "Tätigkeit",
    "table.description": "Beschreibung",
    "error.header": "Die folgenden Daten konnten nicht in toggl gefunden werden",
    "error.missedProjects": "Fehlende Projekte",
    "error.missedTasks": "Fehlende Aufgaben",
    "error.explain": "Ändere Deine Auswahl, oder benenne Projekte und Aufgaben so um, dass sie jenen in toggl entsprechen oder lege sie in toggle an. Der Exportieren Button wird nichts auslösen, bis das Problem behoben ist.",
    "error.noError": "Alles scheint in Ordnung zu sein. Drücke auf den Exportieren Button um die angezeigten Daten in toggl zu importieren.",
    "error.api": "Keinen Zugriff auf deinen toggl Account. Bitte überprüfe den API Key."
  }
}
